<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Adds the ThunderstrikePatchStatus extension attribute, and creates a smart group for non-updated machines.</string>
    <key>Identifier</key>
    <string>com.github.jss-recipes.jss.ThunderstrikePatchStatusEA</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ThunderstrikePatchStatusEA</string>
        <key>CATEGORY</key>
        <string>Management</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string></string>
        <key>SELF_SERVICE_ICON</key>
        <string></string>
        <key>GROUP_NAME</key>
        <string>%NAME%-Not-Patched</string>
        <key>GROUP_TEMPLATE</key>
        <string>ThunderstrikePatchStatusEASmartGroupTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string/>
        <!--Fake out version and pkg_path requirements.-->
        <key>version</key>
        <string />
        <key>pkg_path</key>
        <string />
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>extension_attributes</key>
                <array>
                    <dict>
                        <key>ext_attribute_path</key>
                        <string>ThunderstrikePatchStatusEAExtensionAttribute.xml</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
